Revit 2016 API
Rectangle.Left Property
 The x-coordinate of the top-left corner of the rectangle.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Syntax
C#
public int Left { get; set; }
Visual Basic
Public Property Left As Integer
	Get
	Set
Visual C++
public:
property int Left {
	int get ();
	void set (int value);
}
See Also
Rectangle Class
Autodesk.Revit.UI Namespace